x = [50, 100, 200, 500, 1000]
q1, q2, q3, q4, q5 = 0, 0, 0, 0, 0
print("How much money is needed?")
sum = int(input())
if sum%50==0:
	while sum >= 1000:
		q1 +=1
		sum -= 1000
	print('Количество банкнот: ', q1, '\n',  'Номинал: ', x[4])
	while sum >= 500:
		q2 +=1
		sum -= 500
	print('Количество банкнот: ', q2, '\n', 'Номинал: ', x[3])
	while sum >= 200:
		q3 +=1
		sum -= 200
	print('Количество банкнот: ', q3, '\n', 'Номинал: ', x[2])
	while sum >= 100:
		q4 +=1
		sum -= 100
	print('Количество банкнот: ', q4, '\n', 'Номинал: ', x[1])
	while sum >= 50:
		q5 +=1
		sum -= 50
	print('Количество банкнот: ', q5, '\n', 'Номинал: ', x[0])
else:
	print('Введите сумму кратную 50 грн!')
